src/cf/InformationRegisters/NotDeletedObjects.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>NotDeletedObjects</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AttemptsNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastAttemptTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Comment>ACC:1330 универсальный составной тип, т.к. возможна работа с любыми данными</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/NotDeletedObjects/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Generates a table with the number of attempts for the specified objects.
// If the object has not been deleted before, there will be no record of the number of attempts.
// 
// Parameters:
//   Objects - Array of AnyRef
// Returns:
//   ValueTable:
//   * ItemToDeleteRef - AnyRef
//   * AttemptsNumber - Number
//
Function ObjectsAttemptsCount(Objects) Export
	Query = New Query;
	
	Query.Text =
		"SELECT
		|	NotDeletedObjects.Object AS ItemToDeleteRef,
		|	NotDeletedObjects.AttemptsNumber AS AttemptsNumber
		|FROM
		|	InformationRegister.NotDeletedObjects AS NotDeletedObjects
		|WHERE
		|	NotDeletedObjects.Object IN (&ListOfObjects)
		|	AND NotDeletedObjects.AttemptsNumber > 0";
	
	Query.SetParameter("ListOfObjects", Objects);
	
	QueryResult = Query.Execute();
	ObjectsAttemptsCount = QueryResult.Unload();
	ObjectsAttemptsCount.Indexes.Add("ItemToDeleteRef");
	
	Return ObjectsAttemptsCount;
EndFunction

// Adds an entry to the register.
// 
// Parameters:
//   NotDeletedRef - AnyRef
//
Procedure Add(NotDeletedRef) Export
	Record = InformationRegisters.NotDeletedObjects.CreateRecordManager();
	Record.Object = NotDeletedRef;
	If ValueIsFilled(Record.Object) Then
		Record.Write();
	EndIf;
EndProcedure

#EndRegion

#EndIf
